<?php

$classes = [
	'datePicker' => ['datepickerAR', 'datepicker', 'datepickerTR'],
	'tinymce' => ['tinymceAR', 'tinymce', 'tinymceTR'],
];

$days = [
	0 => _SUNDAY_,
	1 => _MONDAY_,
	2 => _TUESDAY_,
	3 => _WEDNESDAY_,
	4 => _THURSDAY_,
	5 => _FRIDAY_,
	6 => _SATURDAY_,
];

$months = [
	'01' => _JAN_,
	'02' => _FEB_,
	'03' => _MAR_,
	'04' => _APR_,
	'05' => _MAY_,
	'06' => _JUN_,
	'07' => _JUL_,
	'08' => _AUG_,
	'09' => _SEP_,
	'10' => _OCT_,
	'11' => _NOV_,
	'12' => _DEC_
];

$months_ar = [
    1 => 'يناير',
    2 => 'فبراير',
    3 => 'مارس',
    4 => 'أبريل',
    5 => 'مايو',
    6 => 'يونيو',
    7 => 'يوليو',
    8 => 'أغسطس',
    9 => 'سبتمبر',
    10 => 'أكتوبر',
    11 => 'نوفمبر',
    12 => 'ديسمبر'
];

$months_short = [
	1 => 'Jan',
	2 => 'Feb',
	3 => 'Mar',
	4 => 'Apr',
	5 => 'May',
	6 => 'Jun',
	7 => 'Jul',
	8 => 'Aug',
	9 => 'Sep',
	10 => 'Oct',
	11 => 'Nov',
	12 => 'Dec'
];

$months_inverse = [
	'jan' => 1,
	'feb' => 2,
	'mar' => 3,
	'apr' => 4,
	'may' => 5,
	'jun' => 6,
	'jul' => 7,
	'aug' => 8,
	'sep' => 9,
	'oct' => 10,
	'nov' => 11,
	'dec' => 12
];

$thisDay = $days[date('w', time())];

$amPm = [
	'AM' => _AM_,
	'PM' => _PM_,
	'am' => _AM_,
	'pm' => _PM_,
];

$pay_way = [
    'on-delivery' => 'عند التوصيل',
    'bank-transfer' => 'حوالة بنكية'
];

$realestate_currencies = [
    'try' => 'ليرة تركية',
    'usd' => 'دولار أميريكي',
    'eur' => 'يورو',
];

$realestate_rooms = [
    'no' => 'غير معروف',
    'villa' => 'Villa',
    'duplex' => 'Duplex',
    '1+0' => 'استديو' . ' (1+0)',
    '1+1' => '1+1',
    '1.5+1' => '1.5+1',
    '2+1' => '2+1',
    '2.5+1' => '2.5+1',
    '2.5' => '2.5',
    '2+2' => '2+2',
    '3+1' => '3+1',
    '3.5+1' => '3.5+1',
    '3.5' => '3.5',
    '3+2' => '3+2',
    '4+1' => '4+1',
    '4.5+1' => '4.5+1',
    '4+2' => '4+2',
    '4+3' => '4+3',
    '4+4' => '4+4',
    '5+1' => '5+1',
    '5.5+1' => '5.5+1',
    '5+2' => '5+2',
    '5+3' => '5+3',
    '5+4' => '5+4',
    '6+1' => '6+1',
    '6.5+1' => '6.5+1',
    '6+2' => '6+2',
    '6+3' => '6+3',
    '7+1' => '7+1',
    '7.5+1' => '7.5+1',
    '7+2' => '7+2',
    '7+3' => '7+3',
    '8+1' => '8+1',
    '8.5+1' => '8.5+1',
    '8+2' => '8+2',
    '8+3' => '8+3',
    '8+4' => '8+4',
    '9+1' => '9+1',
    '9.5+1' => '9.5+1',
    '9+2' => '9+2',
    '9+3' => '9+3',
    '9+4' => '9+4',
    '9+5' => '9+5',
    '9+6' => '9+6',
    '10+1' => '10+1',
    '10+2' => '10+2',
    'more' => 'أكثر من 10 غرف',
];

$realestate_floor = [
    'no' => 'غير معروف',
    '-4' => '-4',
    '-3' => '-3',
    '-2' => '-2',
    '-1' => '-1',
    'basement' => 'طابق سفلي',
    'ground_floor' => 'طابق أرضي',
    'garden_floor' => 'طابق حديقة',
    'entrance_floor' => 'طابق المدخل',
    'high_entrance' => 'مدخل مرتفع',
    'separate' => 'منفصل',
    'villa_type' => 'نظام فيلات',
    'attic' => 'طابق السطح',
    '1' => '1',
    '2' => '2',
    '3' => '3',
    '4' => '4',
    '5' => '5',
    '6' => '6',
    '7' => '7',
    '8' => '8',
    '9' => '9',
    '10' => '10',
    '11' => '11',
    '12' => '12',
    '13' => '11',
    '14' => '14',
    '15' => '15',
    '16' => '16',
    '17' => '17',
    '18' => '18',
    '19' => '19',
    '20' => '20',
    '21' => '21',
    '22' => '22',
    '23' => '23',
    '24' => '24',
    '25' => '25',
    '26' => '26',
    '27' => '27',
    '28' => '28',
    '29' => '29',
    '30' => '30',
    'more' => "فوق الطابق 30",
];

$realestate_building_age = [
    'no' => 'غير معروف',
    '0' => '0',
    '1' => '1',
    '2' => '2',
    '3' => '3',
    '4' => '4',
    '5-10' => '5-10',
    '11-15' => '11-15',
    '16-20' => '16-20',
    '21-25' => '21-25',
    '26-30' => '26-30',
    'more' => 'أكثر من 30 سنة',
];

$realestate_floors = [
    'no' => 'غير معروف',
    '1' => '1',
    '2' => '2',
    '3' => '3',
    '4' => '4',
    '5' => '5',
    '6' => '6',
    '7' => '7',
    '8' => '8',
    '9' => '9',
    '10' => '10',
    '11' => '11',
    '12' => '12',
    '13' => '11',
    '14' => '14',
    '15' => '15',
    '16' => '16',
    '17' => '17',
    '18' => '18',
    '19' => '19',
    '20' => '20',
    '21' => '21',
    '22' => '22',
    '23' => '23',
    '24' => '24',
    '25' => '25',
    '26' => '26',
    '27' => '27',
    '28' => '28',
    '29' => '29',
    '30' => '30',
    'more' => 'أكثر من 30 طابق',
];

$realestate_heating = [
    'no' => 'غير معروف',
    'stove' => 'مدفأة',
    'gas_stove' => 'مدفأة غاز',
    'central' => 'تدفئة مركزية',
    'combi_boiler' => 'غاز (كومبي)',
    'floor_heating' => 'تدفئة أرضية',
    'air_conditioner' => 'مكيف هواء',
    'fan_coil_conditioner' => 'مكيف سقفي',
    'solar_power' => 'طاقة شمسية',
    'geothermal' => 'تدفئة أرضية',
    'fireplace' => 'موقد حجري',
    'vrv' => 'حجم التبريد المتغير (VRV)',
    'heat_pump' => 'مضخة حرارة',
];

$realestate_paths = [
    'no' => 'غير معروف',
    '1' => '1',
    '2' => '2',
    '3' => '3',
    '4' => '4',
    '5' => '5',
    '6' => '6',
];

$realestate_balcony = [
    'no' => 'غير معروف',
    '0' => 'لا يوجد',
    '1' => 'يوجد',
];

$realestate_furnished = [
    'no' => 'غير معروف',
    '0' => "لا يوجد",
    '1' => "يوجد",
];

$realestate_using_status = [
    'no' => 'غير معروف',
    'empty' => "فارغ",
    'tenanted' => "مستأجر",
    'property_owner' => "سكن المالك",
];

$realestate_site_within = [
    'no' => 'غير معروف',
    '0' => "لا",
    '1' => "نعم",
];

$complexes_types = [
    '1' => 'شقق سكنية',
    '2' => 'مكاتب',
    '3' => 'فلل',
    '4' => 'محلات تجارية',
];